renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_cstd_rtos.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only 
* intended for use with Renesas products. No other uses are authorized. This 
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE 
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS 
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE 
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
* Copyright (C) 2016 Renesas Electronics Corporation. All rights reserved.    
*******************************************************************************/
/*******************************************************************************
* File Name    : r_usb_cstd_rtos.c
* Version      : 1.0
* Description  : Create tasks, mailboxes, memory pool for USB in freeRTOS.
******************************************************************************/
/*****************************************************************************
* History : DD.MM.YYYY Version  Description
*         : 15.06.2016 1.00     First Release
*         : 16.11.2018 1.24     Supporting RTOS Thread safe
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include "r_usb_basic_if.h"
#include "r_usb_typedef.h"

#include "r_usb_extern.h"

#if defined(USB_CFG_HMSC_USE)
#include "r_usb_hmsc_if.h"
#endif /* defined(USB_CFG_HMSC_USE) */

#if defined(USB_CFG_HCDC_USE)
#include "r_usb_hcdc.h"
#endif /* defined(USB_CFG_HCDC_USE) */

#if defined(USB_CFG_HHID_USE)
#include "r_usb_hhid.h"
#endif /* defined(USB_CFG_HHID_USE) */

#if (BSP_CFG_RTOS_USED == 1)
#include <r_usb_cstd_rtos.h>


/******************************************************************************
 Macro definitions
 *****************************************************************************/
#define USB_TMO_VAL     (3000)

/******************************************************************************
Exported global variables (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
******************************************************************************/
/** Declare a task handler for the created tasks. **/
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
static TaskHandle_t g_hcd_tsk_hdl;
static TaskHandle_t g_mgr_tsk_hdl;
  #if USB_CFG_HUB == USB_CFG_ENABLE
static TaskHandle_t g_hub_tsk_hdl;
  #endif  /* USB_CFG_HUB == USB_CFG_ENABLE */
#endif /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */

#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
static TaskHandle_t g_pcd_tsk_hdl;
#endif /* ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI) */

#if defined(USB_CFG_PMSC_USE)
static TaskHandle_t g_pmsc_tsk_hdl;
#endif /* defined(USB_CFG_PMSC_USE) */

#if defined(USB_CFG_HMSC_USE)
SemaphoreHandle_t   SemaphoreHandleRead;
#endif /* defined(USB_CFG_HMSC_USE) */

/** Declare a mailbox handler for the created tasks **/
static QueueHandle_t g_hcd_mbx_hdl;
static QueueHandle_t g_mgr_mbx_hdl;
static QueueHandle_t g_hub_mbx_hdl;
static QueueHandle_t g_pcd_mbx_hdl;
static QueueHandle_t g_cls_mbx_hdl;
static QueueHandle_t g_hmsc_mbx_hdl;
static QueueHandle_t g_hmsc_req_mbx_hdl;
static QueueHandle_t g_hcdc_mbx_hdl;
static QueueHandle_t g_hhid_mbx_hdl;
static QueueHandle_t g_pmsc_mbx_hdl;

static QueueHandle_t g_pipe0_hdl[USB_NUM_USBIP][USB_MAXDEVADDR];       /* USB Transfer MBX for PIPE0 wait que */
static QueueHandle_t g_pipe_hdl[USB_NUM_USBIP][USB_MAXPIPE_NUM + 1];   /* USB Transfer MBX for PIPE1-9 wait que */

/** Declare an array of mailbox handlers. **/
QueueHandle_t *g_mbx_table[] = {
    NULL,                   /* Not used */
    &g_hcd_mbx_hdl,         /* A mailbox handler of USB HCD task */
    &g_mgr_mbx_hdl,         /* A mailbox handler of USB MGR task */
    &g_hub_mbx_hdl,         /* A mailbox handler of USB HUB task */
    &g_cls_mbx_hdl,         /* A mailbox handler of USB internal communication */
    &g_pcd_mbx_hdl,         /* A mailbox handler of USB PCD task */
    &g_hmsc_mbx_hdl,        /* A mailbox handler of USB HMSC */
    &g_hmsc_req_mbx_hdl,    /* A mailbox handler for class request (via PIPE0) of USB HMSC */
    &g_hcdc_mbx_hdl,        /* A mailbox handler of USB HCDC task */
    &g_hhid_mbx_hdl,        /* A mailbox handler of USB HHID task */
    &g_pmsc_mbx_hdl,        /* A mailbox handler of USB PMSC task */
};

/** Declare a memory handler for the created tasks **/
static QueueHandle_t g_hcd_mpl_hdl;
static QueueHandle_t g_mgr_mpl_hdl;
static QueueHandle_t g_hub_mpl_hdl;
static QueueHandle_t g_cls_mpl_hdl;
static QueueHandle_t g_hmsc_mpl_hdl;
static QueueHandle_t g_hmsc_req_mpl_hdl;
static QueueHandle_t g_hcdc_mpl_hdl;
static QueueHandle_t g_hhid_mpl_hdl;
static QueueHandle_t g_pmsc_mpl_hdl;

/** Declare an array of memory pool handlers. **/
QueueHandle_t *g_mpl_table[] = {
    NULL,                   /* Not used */
    &g_hcd_mpl_hdl,         /* A memory pool handler of USB HCD task */
    &g_mgr_mpl_hdl,         /* A memory pool handler of USB MGR task */
    &g_hub_mpl_hdl,         /* A memory pool handler of USB HUB task */
    &g_cls_mpl_hdl,         /* A memory pool handler of USB internal communication */
    NULL,
    &g_hmsc_mpl_hdl,        /* A memory pool handler of USB HMSC */
    &g_hmsc_req_mpl_hdl,    /* A memory pool handler for class request (via PIPE0) of USB HMSC */
    &g_hcdc_mpl_hdl,        /* A memory pool handler of USB HCDC task */
    &g_hhid_mpl_hdl,        /* A memory pool handler of USB HHID task */
    &g_pmsc_mpl_hdl,        /* A memory pool handler of USB PMSC task */
};

