renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_cstd_rtos.c
/******************************************************************************
* Function Name: usb_rtos_configuration
* Description  : Create mailboxes, memory pool using for the created tasks
*                in usb system.
* Arguments    : None
* Return Value : UsbRtos_Success -
*                   Successful.
*                UsbRtos_Err_Init_Mbx -
*                   Failed in mailbox allocation.
*                UsbRtos_Err_Init_Mpl -
*                   Failed in memory pool allocation.
******************************************************************************/
usb_rtos_err_t usb_rtos_configuration(void)
{
    usb_rtos_err_t err = UsbRtos_Success;
    BaseType_t  ret;
    uint16_t ip_loop;
    uint16_t pipe_loop;
    uint16_t addr_loop;

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
    uint16_t i;
    void *tmptr = NULL;

    /** Create mailbox for each task. **/
    /** USB HCD task **/
    g_hcd_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_hcd_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

    /** USB MGR task **/
    g_mgr_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_mgr_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

    /** USB HUB task **/
    g_hub_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_hub_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

    /** USB Internal Communication mailbox **/
    g_cls_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_cls_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

#if defined(USB_CFG_HMSC_USE)
    vSemaphoreCreateBinary(SemaphoreHandleRead); 

    /** USB Host MSC **/
    g_hmsc_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_hmsc_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

    /** USB Host MSC (for class request) **/
    g_hmsc_req_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_hmsc_req_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }
#endif /* defined(USB_CFG_HMSC_USE) */

#if defined(USB_CFG_HCDC_USE)
    /** USB Host CDC **/
    g_hcdc_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_hcdc_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }
#endif /* defined(USB_CFG_HCDC_USE) */

#if defined(USB_CFG_HHID_USE)
    /** USB Host HID **/
    g_hhid_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_hhid_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }
#endif /* defined(USB_CFG_HHID_USE) */

    /** Create memory pool using for each task **/
    /** USB HCD task **/
    g_hcd_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_hcd_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_hcd_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }

    /** USB MGR task **/
    g_mgr_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_mgr_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_mgr_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }

    /** USB HUB task **/
    g_hub_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_hub_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_hub_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }

    /** USB Internal Communication **/
    g_cls_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_cls_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_cls_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }

#if defined(USB_CFG_HMSC_USE)
    /** USB Host MSC **/
    g_hmsc_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_hmsc_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_hmsc_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }

    /** USB Host MSC (for class request) **/
    g_hmsc_req_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_hmsc_req_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_hmsc_req_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }
#endif /* defined(USB_CFG_HMSC_USE) */

#if defined(USB_CFG_HCDC_USE)
    /** USB Host CDC **/
    g_hcdc_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_hcdc_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_hcdc_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }
#endif /* defined(USB_CFG_HCDC_USE) */

#if defined(USB_CFG_HHID_USE)
    /** USB Host HID **/
    g_hhid_mpl_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL != g_hhid_mpl_hdl)
    {
        /* WAIT_LOOP */
        for (i = 0; i < QUEUE_SIZE; i++)
        {
            tmptr = pvPortMalloc(sizeof(usb_utr_t));
            if (NULL == tmptr)
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
            else
            {
                xQueueSend(g_hhid_mpl_hdl, &tmptr, 0);
            }
        }
    }
    else
    {
        err = UsbRtos_Err_Init_Mpl;
        return err;
    }
#endif /* defined(USB_CFG_HHID_USE) */

    /** USB Tasks Creation **/
    ret = xTaskCreate((TaskFunction_t)usb_hstd_hcd_task,    /** Entry function of USB HCD task  **/
                     "HCD_TSK",             /** Name of USB HCD task            **/
                     HCD_STACK_SIZE,        /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     HCD_TSK_PRI,           /** Task's priority                 **/
                     &g_hcd_tsk_hdl);       /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

  #if USB_CFG_HUB == USB_CFG_ENABLE
    ret = xTaskCreate((TaskFunction_t)usb_hhub_task,        /** Entry function of USB HUB task  **/
                     "HUB_TSK",             /** Name of USB HUB task            **/
                     HUB_STACK_SIZE,        /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     HUB_TSK_PRI,           /** Task's priority                 **/
                     &g_hub_tsk_hdl);       /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }
  #endif  /* USB_CFG_HUB == USB_CFG_ENABLE */

    ret = xTaskCreate((TaskFunction_t)usb_hstd_mgr_task,    /** Entry function of USB MGR task  **/
                     "MGR_TSK",             /** Name of USB MGR task            **/
                     MGR_STACK_SIZE,        /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     MGR_TSK_PRI,           /** Task's priority                 **/
                     &g_mgr_tsk_hdl);       /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

