renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_cstd_rtos.c
#endif /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */
    
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
    /** USB Tasks Creation **/
    ret = xTaskCreate((TaskFunction_t)usb_pstd_pcd_task,    /** Entry function of USB HCD task  **/
                     "PCD_TSK",             /** Name of USB HCD task            **/
                     PCD_STACK_SIZE,        /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     PCD_TSK_PRI,           /** Task's priority                 **/
                     &g_pcd_tsk_hdl);       /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

    /** Create mailbox **/
    /** USB PCD task **/
    g_pcd_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_pcd_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

#endif /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */

#if defined(USB_CFG_PMSC_USE)
    /** USB Tasks Creation **/
    ret = xTaskCreate((TaskFunction_t)usb_pmsc_task,    /** Entry function of USB PMSC task  **/
                     "PMSC_TSK",            /** Name of USB HCD task            **/
                     PMSC_STACK_SIZE,       /** Stack size in words             **/
                     NULL,                  /** Task's parameter                **/
                     PMSC_TSK_PRI,          /** Task's priority                 **/
                     &g_pmsc_tsk_hdl);      /** Task handler for use later      **/
    if (pdPASS != ret)
    {
        err = UsbRtos_Err_Init_Tsk;
        return err;
    }

    /** Create mailbox **/
    /** USB PMSC task **/
    g_pmsc_mbx_hdl = xQueueCreate(QUEUE_SIZE, sizeof(void *));
    if (NULL == g_pmsc_mbx_hdl)
    {
        err = UsbRtos_Err_Init_Mbx;
        return err;
    }

#endif  /* defined(USB_CFG_PMSC_USE) */

    /* WAIT_LOOP */
    for (ip_loop = 0; ip_loop <USB_NUM_USBIP; ip_loop++)
    {
        /** Create memory pool using for pipe process **/
        /* WAIT_LOOP */
        for (addr_loop = 0; addr_loop <USB_MAXDEVADDR; addr_loop++)
        {
            g_pipe0_hdl[ip_loop][addr_loop] = xQueueCreate(QUEUE_SIZE, sizeof(void *));
            if (NULL == g_pipe0_hdl[ip_loop][addr_loop])
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
        }
        /* WAIT_LOOP */
        for (pipe_loop = 0; pipe_loop <(USB_MAXPIPE_NUM+1); pipe_loop++)
        {
            g_pipe_hdl[ip_loop][pipe_loop] = xQueueCreate(QUEUE_SIZE, sizeof(void *));
            if (NULL == g_pipe_hdl[ip_loop][pipe_loop])
            {
                err = UsbRtos_Err_Init_Mpl;
                return err;
            }
        }
    }
    return err;
} /* End of function usb_rtos_configuration() */

/******************************************************************************
 Function Name   : usb_cstd_rec_msg
 Description     : Receive a message to the specified id (mailbox).
 Argument        : uint8_t      id      : ID number (mailbox).
                 : usb_msg_t**  mess    : Message pointer
                 : usb_tm_t     tm      : Timeout Value
 Return          : uint16_t             : USB_OK / USB_ERROR
 ******************************************************************************/
usb_er_t usb_cstd_rec_msg (uint8_t id, usb_msg_t** mess, usb_tm_t tm)
{
    BaseType_t err;
    QueueHandle_t handle;

    (void *)tm;

    if (NULL == mess)
    {
        return USB_ERROR;
    }

    handle = (QueueHandle_t)( *(g_mbx_table[id]) );
    *mess  = NULL;

    if (0 == tm)
    {
        tm = USB_TMO_VAL;
    }

    /** Receive message from queue specified by *(mbx_table[id]) **/
    err = xQueueReceive(handle, (void *)mess, (TickType_t)tm);
    if ((pdTRUE == err) && (NULL != (*mess)))
    {
        return USB_OK;
    }
    else
    {
        return USB_ERROR;
    }
}
/******************************************************************************
 End of function usb_cstd_rec_msg
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_snd_msg
 Description     : Send a message to the specified id (mailbox).
 Argument        : uint8_t      id      : ID number (mailbox).
                 : usb_msg_t*   mess    : Message pointer
 Return          : usb_er_t             : USB_OK / USB_ERROR
 ******************************************************************************/
usb_er_t usb_cstd_snd_msg (uint8_t id, usb_msg_t* mess)
{
    BaseType_t err;
    QueueHandle_t handle;

    if (NULL == mess)
    {
        return USB_ERROR;
    }

    handle = (QueueHandle_t)( *(g_mbx_table[id]) );

    /** Send message to queue specified by *(mbx_table[id]) **/
    err = xQueueSend(handle, (const void *)&mess, (TickType_t)(0));
    if (pdTRUE == err)
    {
        return USB_OK;
    }
    else
    {
        return USB_ERROR;
    }
}
/******************************************************************************
 End of function usb_cstd_snd_msg
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_isnd_msg
 Description     : Send a message to the specified id (mailbox) while executing 
                 : an interrupt.
 Argument        : uint8_t      id      : ID number (mailbox).
                 : usb_msg_t*   mess    : Message pointer
 Return          : usb_er_t             : USB_OK / USB_ERROR
 ******************************************************************************/
usb_er_t usb_cstd_isnd_msg (uint8_t id, usb_msg_t* mess)
{
    BaseType_t err;
    QueueHandle_t handle;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (NULL == mess)
    {
        return USB_ERROR;
    }

    handle = (QueueHandle_t)( *(g_mbx_table[id]) );

    /** Send message to queue specified by *(mbx_table[id]) from ISR **/
    err = xQueueSendFromISR(handle, (const void *)&mess, &xHigherPriorityTaskWoken);
    if (pdTRUE == err)
    {
        portYIELD_FROM_ISR ( xHigherPriorityTaskWoken );
        return USB_OK;
    }
    else
    {
        return USB_ERROR;
    }
}
/******************************************************************************
 End of function usb_cstd_isnd_msg
 ******************************************************************************/

