renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_cstd_rtos.c
    ip = ptr->ip;

    vPortFree (ptr);
    if ((USB_MIN_PIPE_NO > pipe_no) || (USB_MAXPIPE_NUM < pipe_no))
    {
        return;
    }

    /* WAIT_LOOP */
    do
    {
        /** Receive message from queue specified by *(mbx_table[id]) **/
        err = xQueueReceive(g_pipe_hdl[ip][pipe_no], (void *)&mess, (TickType_t)(0));
        if ((pdTRUE == err) && (NULL != (mess)))
        {
            vPortFree (mess);
        }
        else
        {
            break;
        }
    } while (pdTRUE == err);
}
/******************************************************************************
 End of function usb_cstd_pipe_msg_clear
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_pipe0_msg_clear
 Description     : Message clear for PIPE0 Transfer wait que.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  dev_addr   : device address
 Return          : none
 ******************************************************************************/
void usb_cstd_pipe0_msg_clear (usb_utr_t *ptr, uint16_t dev_addr)
{
    BaseType_t  err;
    usb_msg_t   *mess;
    uint16_t    ip;

    ip = ptr->ip;

    vPortFree (ptr);
    if ((USB_DEVICEADDR > dev_addr) || (USB_MAXDEVADDR < dev_addr))
    {
        return;
    }

    /* WAIT_LOOP */
    do
    {
        /** Receive message from queue specified by *(mbx_table[id]) **/
        err = xQueueReceive(g_pipe0_hdl[ip][dev_addr], (void *)&mess, (TickType_t)(0));
        if ((pdTRUE == err) && (NULL != (mess)))
        {
            vPortFree (mess);
        }
        else
        {
            break;
        }
    } while (pdTRUE == err);
}
/******************************************************************************
 End of function usb_cstd_pipe0_msg_clear
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_pipe_msg_re_forward
 Description     : Get PIPE Transfer wait que and Message send to HCD/PCD
 Argument        : uint16_t  pipe_no    : Pipe no.
 Return          : none
 ******************************************************************************/
void usb_cstd_pipe_msg_re_forward (uint16_t ip_no, uint16_t pipe_no)
{
    BaseType_t      err;
    usb_msg_t       *mess;
    QueueHandle_t   handle;
    uint8_t         id;

    if ((USB_MIN_PIPE_NO > pipe_no) || (USB_MAXPIPE_NUM < pipe_no))
    {
        return;
    }

    /** Receive message from queue specified by *(mbx_table[id]) **/
    err = xQueueReceive(g_pipe_hdl[ip_no][pipe_no], (void *)&mess, (TickType_t)(0));
    if ((pdTRUE == err) && (NULL != (mess)))
    {
        if (USB_HOST == g_usb_usbmode)
        {
            id = USB_HCD_MBX;
        }
        else
        {
            id = USB_PCD_MBX;
        }

        handle = (QueueHandle_t)(*(g_mbx_table[id]));

        /** Send message to queue specified by *(mbx_table[id]) **/
        xQueueSend(handle, (const void *)&mess, (TickType_t)(0));
    }
}
/******************************************************************************
 End of function usb_cstd_pipe_msg_re_forward
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_pipe0_msg_re_forward
 Description     : Get PIPE0 Transfer wait que and Message send to HCD/PCD
 Argument        : none
 Return          : none
 ******************************************************************************/
void usb_cstd_pipe0_msg_re_forward (uint16_t ip_no)
{
    BaseType_t      err;
    usb_msg_t       *mess;
    QueueHandle_t   handle;
    uint8_t         id;
    uint8_t         dev_addr;

    /* WAIT_LOOP */
    for (dev_addr =0; dev_addr <USB_MAXDEVADDR; dev_addr++)
    {
        /** Receive message from queue specified by *(mbx_table[id]) **/
        err = xQueueReceive(g_pipe0_hdl[ip_no][dev_addr], (void *)&mess, (TickType_t)(0));
        if ((pdTRUE == err) && (NULL != (mess)))
        {
            if (USB_HOST == g_usb_usbmode)
            {
                id = USB_HCD_MBX;
            }
            else
            {
                id = USB_PCD_MBX;
            }

            handle = (QueueHandle_t)(*(g_mbx_table[id]));

            /** Send message to queue specified by *(mbx_table[id]) **/
            xQueueSend(handle, (const void *)&mess, (TickType_t)(0));
            return;
        }
    }
}
/******************************************************************************
 End of function usb_cstd_pipe0_msg_re_forward
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_pipe_msg_forward
 Description     : Message foward to PIPE Transfer wait que.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipe_no    : Pipe no.
 Return          : none
 ******************************************************************************/
void usb_cstd_pipe_msg_forward (usb_utr_t *ptr, uint16_t pipe_no)
{
    if ((USB_MIN_PIPE_NO > pipe_no) || (USB_MAXPIPE_NUM < pipe_no))
    {
        return;
    }

    /** Send message to queue specified by *(mbx_table[id]) **/
    xQueueSend(g_pipe_hdl[ptr->ip][pipe_no], (const void *)&ptr, (TickType_t)(0));
}
/******************************************************************************
 End of function usb_cstd_pipe_msg_forward
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_cstd_pipe0_msg_forward
 Description     : Message foward to PIPE0 Transfer wait que.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  dev_addr   : device address
 Return          : none
 ******************************************************************************/
void usb_cstd_pipe0_msg_forward (usb_utr_t *ptr, uint16_t dev_addr)
{
    if ((USB_DEVICEADDR > dev_addr) || (USB_MAXDEVADDR < dev_addr))
    {
        return;
    }

    /** Send message to queue specified by *(mbx_table[id]) **/
    xQueueSend(g_pipe0_hdl[ptr->ip][dev_addr], (const void *)&ptr, (TickType_t)(0));
}
/******************************************************************************
 End of function usb_cstd_pipe0_msg_forward
 ******************************************************************************/

#endif /* (BSP_CFG_RTOS_USED == 1) */
